wojtek327/-49-_stm32_bmi160_spi/stm32_bmi160_spi.c
#include "stm32_bmi160_spi.h"

#define _BMI160_CS_ENABLE()			HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_RESET);
#define _BMI160_CS_DISABLE()		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_SET);

#define BMI160_SIGN_EXTEND(val, from) \
    (((val) & (1 << ((from) - 1))) ? (val | (((1 << (1 + (sizeof(val) << 3) - (from))) - 1) << (from))) : val)

extern SPI_HandleTypeDef hspi1;

static HAL_StatusTypeDef BMI160_SPI_WriteRegister(uint8_t address, uint8_t cmd);
static HAL_StatusTypeDef BMI160_SPI_ReadRegister(uint8_t address, uint8_t dataSize, uint8_t *rec);
static HAL_StatusTypeDef BMI160_WriteSPI(const uint8_t registerAddr, uint8_t *bufferPtr, const uint8_t bufferSize);
static HAL_StatusTypeDef BMI160_ReadSPI(const uint8_t registerAddr, uint8_t *bufferPtr, const uint8_t bufferSize);
static HAL_StatusTypeDef BMI160_SPI_WriteRegisterBits(uint8_t reg, uint8_t data, unsigned pos, unsigned len);
static uint8_t BMI160_SPI_ReadRegBits(uint8_t reg, unsigned pos, unsigned len);
static HAL_StatusTypeDef BMI160_ReadWriteSPI(const uint8_t registerAddr, uint8_t *bufferPtr, const uint8_t bufferSize);

HAL_StatusTypeDef (*BMI160_WriteToRegister)(uint8_t, uint8_t);
HAL_StatusTypeDef (*BMI160_ReadFromRegister)(uint8_t, uint8_t, uint8_t*);

typedef struct BMI160_CommuniFunct bmi160_funct;

HAL_StatusTypeDef BMI160_SPI_Initialize(void)
{
	HAL_StatusTypeDef opStatus = HAL_ERROR;

	BMI160_WriteToRegister = BMI160_SPI_WriteRegister;
	BMI160_ReadFromRegister = BMI160_SPI_ReadRegister;

	opStatus = BMI160_SPI_PerformSoftReset();
	if(opStatus != HAL_OK) { return opStatus; }

	HAL_Delay(300);

	if(BMI160_SPI_CheckSensorID() == 0) { return HAL_ERROR; }

	opStatus = BMI160_SPI_PowerUpAccelerometer();
	if(opStatus != HAL_OK) { return opStatus; }

	opStatus = BMI160_SPI_PowerUpGyroscope();
	if(opStatus != HAL_OK) { return opStatus; }

	opStatus = BMI160_SPI_SetFullScaleGyroRange(BMI160_GYRO_RANGE_250);
	if(opStatus != HAL_OK) { return opStatus; }

	opStatus = BMI160_SPI_SetFullScaleAccelRange(BMI160_ACCEL_RANGE_2G);
	if(opStatus != HAL_OK) { return opStatus; }

    uint8_t dataToSend[1] = {0x00};
    dataToSend[0] = 0xFF;

    opStatus = BMI160_WriteSPI(BMI160_RA_INT_MAP_0, &dataToSend[0], 1);
	if(opStatus != HAL_OK) { return opStatus; }

    dataToSend[0] = 0xF0;
    opStatus = BMI160_WriteSPI(BMI160_RA_INT_MAP_1, &dataToSend[0], 1);
	if(opStatus != HAL_OK) { return opStatus; }

    dataToSend[0] = 0x00;
    opStatus = BMI160_WriteSPI(BMI160_RA_INT_MAP_2, &dataToSend[0], 1);
	if(opStatus != HAL_OK) { return opStatus; }

	return HAL_OK;
}

HAL_StatusTypeDef BMI160_SPI_PerformSoftReset(void)
{
	//uint8_t buffer[1] = {BMI160_CMD_SOFT_RESET};
	//HAL_StatusTypeDef opStatus = BMI160_WriteSPI(BMI160_RA_CMD, &buffer[0], 1);
	//HAL_StatusTypeDef opStatus = BMI160_SPI_WriteRegister(BMI160_RA_CMD, BMI160_CMD_SOFT_RESET);

	HAL_StatusTypeDef opStatus = BMI160_WriteToRegister(BMI160_RA_CMD, BMI160_CMD_SOFT_RESET);
	return opStatus;
}

uint8_t BMI160_SPI_ReadChipID(void)
{
	uint8_t array[1] = {0x00};
	//HAL_StatusTypeDef opStatus = BMI160_ReadSPI(BMI160_RA_CHIP_ID, &array[0], 1);
	//HAL_StatusTypeDef opStatus = BMI160_SPI_ReadRegister(BMI160_RA_CHIP_ID, 1, &array[0]);
	HAL_StatusTypeDef opStatus = BMI160_ReadFromRegister(BMI160_RA_CHIP_ID, 1, &array[0]);
	if(opStatus != HAL_OK) { return (uint8_t)opStatus; }

	return array[0];
}

HAL_StatusTypeDef BMI160_SPI_PowerUpAccelerometer(void)
{
	uint8_t buffer[1] = {BMI160_CMD_ACC_MODE_NORMAL};
	HAL_StatusTypeDef opStatus = BMI160_WriteSPI(BMI160_RA_CMD, &buffer[0], 1);

	if(opStatus != HAL_OK) { return opStatus; }

	HAL_Delay(2);

	while(0x1 != BMI160_SPI_ReadRegBits(BMI160_RA_PMU_STATUS, BMI160_ACC_PMU_STATUS_BIT, BMI160_ACC_PMU_STATUS_LEN)) { HAL_Delay(1); }

	return HAL_OK;
}

HAL_StatusTypeDef BMI160_SPI_PowerUpGyroscope(void)
{
	uint8_t buffer[1] = {BMI160_CMD_GYR_MODE_NORMAL};
	HAL_StatusTypeDef opStatus = BMI160_WriteSPI(BMI160_RA_CMD, &buffer[0], 1);

	if(opStatus != HAL_OK) { return opStatus; }

	HAL_Delay(2);

	while(0x1 != BMI160_SPI_ReadRegBits(BMI160_RA_PMU_STATUS, BMI160_GYR_PMU_STATUS_BIT, BMI160_GYR_PMU_STATUS_LEN)) { HAL_Delay(1); }

	return HAL_OK;
}

uint8_t BMI160_SPI_CheckSensorID(void) {
	uint8_t readedChipId = BMI160_SPI_ReadChipID();

	if(readedChipId == SENSOR_CHIP_ID_BMI160) { return 1; }
	else if(readedChipId == SENSOR_CHIP_ID_BMI160_C2) { return 2; }
	else if(readedChipId == SENSOR_CHIP_ID_BMI160_C3) { return 3; }

	return 0;
}

HAL_StatusTypeDef BMI160_SPI_ReadGyro(int16_t* x, int16_t* y, int16_t* z) {
    uint8_t buffer[6] = {0x00};

    HAL_StatusTypeDef opStat = BMI160_ReadSPI(BMI160_RA_GYRO_X_L, &buffer[0], 6);
    int16_t xa = 0;
	int16_t ya = 0;
	int16_t za = 0;

    //*(x+0) = (((int16_t)buffer[1]) << 8) | buffer[0];
    //*(y+0) = (((int16_t)buffer[3]) << 8) | buffer[2];
    //*(z+0) = (((int16_t)buffer[5]) << 8) | buffer[4];

	//xa = (((int16_t)buffer[1]) << 8) | buffer[0];
	//ya = (((int16_t)buffer[3]) << 8) | buffer[2];
	//za = (((int16_t)buffer[5]) << 8) | buffer[4];

    return opStat;
}

float BMI160_SPI_ScaledData(const int16_t gRaw, const BMI160GyroRange gyroRange) {
  float g = 0.0F;

  if(gyroRange == BMI160_GYRO_RANGE_2000) { g = (gRaw / SENS_2000_DPS_LSB_PER_DPS); }
  else if(gyroRange == BMI160_GYRO_RANGE_1000) { g = (gRaw / SENS_1000_DPS_LSB_PER_DPS); }
  else if(gyroRange == BMI160_GYRO_RANGE_500) { g = (gRaw / SENS_500_DPS_LSB_PER_DPS); }
  else if(gyroRange == BMI160_GYRO_RANGE_250) { g = (gRaw / SENS_250_DPS_LSB_PER_DPS); }
  else if(gyroRange == BMI160_GYRO_RANGE_125) { g = (gRaw / SENS_125_DPS_LSB_PER_DPS); }

  return g;
}

int16_t BMI160_SPI_GetTemperature(void) {
    uint8_t buffer[2] = {0x00};

    HAL_StatusTypeDef opStat = BMI160_ReadSPI(BMI160_RA_TEMP_L, &buffer[0], 2);

    if(opStat != HAL_OK) { return HAL_ERROR; }
    return (((int16_t)buffer[1]) << 8) | buffer[0];
}

float BMI160_SPI_ConvertRawTemp(int16_t tempRaw)
{
	float convertTemp = 0;

    if(tempRaw & 0x8000) { convertTemp = (23.0F - ((0x10000 - tempRaw)/512.0F)); }
    else { convertTemp = ((tempRaw/512.0F) + 23.0F); }

    return convertTemp;
}

int16_t BMI160_SPI_GetAccelerationX(void) {
    uint8_t buffer[2] = {0x00};

