wojtek327/-49-_stm32_bmi160_spi/stm32_bmi160_spi.c
    HAL_StatusTypeDef opStat = BMI160_ReadSPI(BMI160_RA_ACCEL_X_L, &buffer[0], 2);

    if(opStat != HAL_OK) { return HAL_ERROR; }
    return (((int16_t)buffer[1]) << 8) | buffer[0];
}

int16_t BMI160_SPI_GetAccelerationY(void) {
    uint8_t buffer[2] = {0x00};

    HAL_StatusTypeDef opStat = BMI160_ReadSPI(BMI160_RA_ACCEL_Y_L, &buffer[0], 2);

    if(opStat != HAL_OK) { return HAL_ERROR; }

    return (((int16_t)buffer[1]) << 8) | buffer[0];
}

int16_t BMI160_SPI_GetAccelerationZ(void) {
    uint8_t buffer[2] = {0x00};

    HAL_StatusTypeDef opStat = BMI160_ReadSPI(BMI160_RA_ACCEL_Z_L, &buffer[0], 2);

    if(opStat != HAL_OK) { return HAL_ERROR; }

    return (((int16_t)buffer[1]) << 8) | buffer[0];
}

HAL_StatusTypeDef BMI160_SPI_GetAcceleration(int16_t* x, int16_t* y, int16_t* z) {
    uint8_t buffer[6] = {0x00};

    HAL_StatusTypeDef opStat = BMI160_ReadSPI(BMI160_RA_ACCEL_X_L, &buffer[0], 6);

    *x = (((int16_t)buffer[1]) << 8) | buffer[0];
    *y = (((int16_t)buffer[3]) << 8) | buffer[2];
    *z = (((int16_t)buffer[5]) << 8) | buffer[4];

    return opStat;
}

HAL_StatusTypeDef BMI160_SPI_GetMotion6(int16_t* ax, int16_t* ay, int16_t* az, int16_t* gx, int16_t* gy, int16_t* gz) {
    uint8_t buffer[12] = {0x00};

    HAL_StatusTypeDef opStat = BMI160_ReadSPI(BMI160_RA_GYRO_X_L, &buffer[0], 12);

    *gx = (((int16_t)buffer[1])  << 8) | buffer[0];
    *gy = (((int16_t)buffer[3])  << 8) | buffer[2];
    *gz = (((int16_t)buffer[5])  << 8) | buffer[4];
    *ax = (((int16_t)buffer[7])  << 8) | buffer[6];
    *ay = (((int16_t)buffer[9])  << 8) | buffer[8];
    *az = (((int16_t)buffer[11]) << 8) | buffer[10];

    return opStat;
}

BMI160GyroRate BMI160_SPI_GetGyroRate(void) {
	return (BMI160GyroRate)BMI160_SPI_ReadRegBits(BMI160_RA_GYRO_CONF, BMI160_GYRO_RATE_SEL_BIT, BMI160_GYRO_RATE_SEL_LEN);
}

HAL_StatusTypeDef BMI160_SPI_SetGyroRate(const BMI160GyroRate rate) {
	return BMI160_SPI_WriteRegisterBits(BMI160_RA_GYRO_CONF, (uint8_t)rate, BMI160_GYRO_RATE_SEL_BIT, BMI160_GYRO_RATE_SEL_LEN);
}

BMI160AccelRate BMI160_SPI_GetAccelRate(void) {
	return (BMI160AccelRate)BMI160_SPI_ReadRegBits(BMI160_RA_ACCEL_CONF, BMI160_ACCEL_RATE_SEL_BIT, BMI160_ACCEL_RATE_SEL_LEN);
}

HAL_StatusTypeDef BMI160_SPI_SetAccelRate(const BMI160AccelRate rate) {
	return BMI160_SPI_WriteRegisterBits(BMI160_RA_ACCEL_CONF, (uint8_t)rate, BMI160_ACCEL_RATE_SEL_BIT, BMI160_ACCEL_RATE_SEL_LEN);
}

BMI160DLPFMode BMI160_SPI_GetGyroDLPFMode(void) {
    return (BMI160DLPFMode)BMI160_SPI_ReadRegBits(BMI160_RA_GYRO_CONF, BMI160_GYRO_DLPF_SEL_BIT, BMI160_GYRO_DLPF_SEL_LEN);
}

HAL_StatusTypeDef BMI160_SPI_SetGyroDLPFMode(BMI160DLPFMode mode) {
	return BMI160_SPI_WriteRegisterBits(BMI160_RA_GYRO_CONF, mode, BMI160_GYRO_DLPF_SEL_BIT, BMI160_GYRO_DLPF_SEL_LEN);
}

BMI160DLPFMode BMI160_SPI_GetAccelDLPFMode(void) {
    return (BMI160DLPFMode)BMI160_SPI_ReadRegBits(BMI160_RA_ACCEL_CONF, BMI160_ACCEL_DLPF_SEL_BIT, BMI160_ACCEL_DLPF_SEL_LEN);
}

HAL_StatusTypeDef BMI160_SPI_SetAccelDLPFMode(BMI160DLPFMode mode) {
    return BMI160_SPI_WriteRegisterBits(BMI160_RA_ACCEL_CONF, mode, BMI160_ACCEL_DLPF_SEL_BIT, BMI160_ACCEL_DLPF_SEL_LEN);
}

BMI160GyroRange BMI160_SPI_GetFullScaleGyroRange(void) {
	return (BMI160GyroRange)BMI160_SPI_ReadRegBits(BMI160_RA_GYRO_RANGE, BMI160_GYRO_RANGE_SEL_BIT, BMI160_GYRO_RANGE_SEL_LEN);
}

HAL_StatusTypeDef BMI160_SPI_SetFullScaleGyroRange(const BMI160GyroRange range) {
    return BMI160_SPI_WriteRegisterBits(BMI160_RA_GYRO_RANGE, (uint8_t)range, BMI160_GYRO_RANGE_SEL_BIT, BMI160_GYRO_RANGE_SEL_LEN);
}

BMI160AccelRange BMI160_SPI_GetFullScaleAccelRange(void) {
	return (BMI160AccelRange)BMI160_SPI_ReadRegBits(BMI160_RA_ACCEL_RANGE, BMI160_ACCEL_RANGE_SEL_BIT, BMI160_ACCEL_RANGE_SEL_LEN);
}

HAL_StatusTypeDef BMI160_SPI_SetFullScaleAccelRange(const BMI160AccelRange range) {
	return BMI160_SPI_WriteRegisterBits(BMI160_RA_ACCEL_RANGE, (uint8_t)range, BMI160_ACCEL_RANGE_SEL_BIT, BMI160_ACCEL_RANGE_SEL_LEN);
}

uint8_t BMI160_SPI_GetAccelOffsetEnabled(void) {
    return !!(BMI160_SPI_ReadRegBits(BMI160_RA_OFFSET_6, BMI160_ACC_OFFSET_EN, 1));
}

HAL_StatusTypeDef BMI160_SPI_SetAccelOffsetEnabled(const uint8_t enabled) {
	return BMI160_SPI_WriteRegisterBits(BMI160_RA_OFFSET_6, enabled ? 0x1 : 0, BMI160_ACC_OFFSET_EN, 1);
}

HAL_StatusTypeDef BMI160_SPI_AutoCalibrateXAccelOffset(int target)
{
    uint8_t foc_conf = 0;
    if (target == 1) { foc_conf = (0x1 << BMI160_FOC_ACC_X_BIT); }
    else if (target == -1) { foc_conf = (0x2 << BMI160_FOC_ACC_X_BIT); }
    else if (target == 0) { foc_conf = (0x3 << BMI160_FOC_ACC_X_BIT); }
    else { return HAL_ERROR; }

    uint8_t commandToSend[1] = {0x00};
    commandToSend[0] = foc_conf;

    BMI160_WriteSPI(BMI160_RA_FOC_CONF, &commandToSend[0], 1);
    commandToSend[0] = BMI160_CMD_START_FOC;

    BMI160_WriteSPI(BMI160_RA_CMD, &commandToSend[0], 1);

    while (!(BMI160_SPI_ReadRegBits(BMI160_RA_STATUS, BMI160_STATUS_FOC_RDY, 1))) { HAL_Delay(1); }

    return HAL_OK;
}

HAL_StatusTypeDef BMI160_SPI_AutoCalibrateYAccelOffset(int target) {
    uint8_t foc_conf = 0;
    if (target == 1) { foc_conf = (0x1 << BMI160_FOC_ACC_Y_BIT); }
    else if (target == -1) { foc_conf = (0x2 << BMI160_FOC_ACC_Y_BIT); }
    else if (target == 0) { foc_conf = (0x3 << BMI160_FOC_ACC_Y_BIT); }
    else { return HAL_ERROR; }

    uint8_t commandToSend[1] = {0x00};
    commandToSend[0] = foc_conf;
    BMI160_WriteSPI(BMI160_RA_FOC_CONF, &commandToSend[0], 1);

    commandToSend[0] = BMI160_CMD_START_FOC;
    BMI160_WriteSPI(BMI160_RA_CMD, &commandToSend[0], 1);

    while (!(BMI160_SPI_ReadRegBits(BMI160_RA_STATUS, BMI160_STATUS_FOC_RDY, 1))) { HAL_Delay(1); }

    return HAL_OK;
}

HAL_StatusTypeDef BMI160_SPI_AutoCalibrateZAccelOffset(int target) {
    uint8_t foc_conf = 0;

    if (target == 1) { foc_conf = (0x1 << BMI160_FOC_ACC_Z_BIT); }
    else if (target == -1) { foc_conf = (0x2 << BMI160_FOC_ACC_Z_BIT); }
    else if (target == 0) { foc_conf = (0x3 << BMI160_FOC_ACC_Z_BIT); }
    else { return HAL_ERROR; }

    uint8_t commandToSend[1] = {0x00};
    commandToSend[0] = foc_conf;
    BMI160_WriteSPI(BMI160_RA_FOC_CONF, &commandToSend[0], 1);
    commandToSend[0] = BMI160_CMD_START_FOC;
    BMI160_WriteSPI(BMI160_RA_CMD, &commandToSend[0], 1);

    while (!(BMI160_SPI_ReadRegBits(BMI160_RA_STATUS, BMI160_STATUS_FOC_RDY, 1))) { HAL_Delay(1); }

    return HAL_OK;
}

int8_t BMI160_SPI_GetXAccelOffset(void) {
	uint8_t readData = 0;
	HAL_StatusTypeDef opStatus = BMI160_ReadSPI(BMI160_RA_OFFSET_0, &readData, 1);

