wojtek327/-49-_stm32_bmi160_spi/stm32_bmi160_spi.c
	if(opStatus != HAL_OK) {
		return opStatus;
	}
    return readData;
}

HAL_StatusTypeDef BMI160_SPI_SetXAccelOffset(int8_t offset) {
	uint8_t buffer[1] = { offset };
	HAL_StatusTypeDef opStatus = BMI160_WriteSPI(BMI160_RA_OFFSET_0, &buffer[0], 1);

    return opStatus;
}

int8_t BMI160_SPI_GetYAccelOffset(void) {
	uint8_t readData = 0;
	HAL_StatusTypeDef opStatus = BMI160_ReadSPI(BMI160_RA_OFFSET_1, &readData, 1);

	if(opStatus != HAL_OK) { return opStatus; }
    return readData;
}

HAL_StatusTypeDef BMI160_SPI_SetYAccelOffset(int8_t offset) {
	uint8_t buffer[1] = { offset };
	HAL_StatusTypeDef opStatus = BMI160_WriteSPI(BMI160_RA_OFFSET_1, &buffer[0], 1);
    return opStatus;
}

int8_t BMI160_SPI_GetZAccelOffset(void) {
	uint8_t readData = 0;
	HAL_StatusTypeDef opStatus = BMI160_ReadSPI(BMI160_RA_OFFSET_2, &readData, 1);

	if(opStatus != HAL_OK) { return opStatus; }

    return readData;
}

HAL_StatusTypeDef BMI160_SPI_SetZAccelOffset(int8_t offset) {
	uint8_t buffer[1] = { offset };
	HAL_StatusTypeDef opStatus = BMI160_WriteSPI(BMI160_RA_OFFSET_2, &buffer[0], 1);

    return opStatus;
}

uint8_t BMI160_SPI_GetGyroOffsetEnabled(void) {
    return !!(BMI160_SPI_ReadRegBits(BMI160_RA_OFFSET_6, BMI160_GYR_OFFSET_EN, 1));
}

HAL_StatusTypeDef BMI160_SPI_SetGyroOffsetEnabled(uint8_t enabled) {
	return BMI160_SPI_WriteRegisterBits(BMI160_RA_OFFSET_6, enabled ? 0x1 : 0, BMI160_GYR_OFFSET_EN, 1);
}

HAL_StatusTypeDef BMI160_SPI_AutoCalibrateGyroOffset(void) {
    uint8_t foc_conf = (1 << BMI160_FOC_GYR_EN);

    uint8_t commandToSend[1] = {0x00};
    commandToSend[0] = foc_conf;
    BMI160_WriteSPI(BMI160_RA_FOC_CONF, &commandToSend[0], 1);
    commandToSend[0] = BMI160_CMD_START_FOC;
    BMI160_WriteSPI(BMI160_RA_CMD, &commandToSend[0], 1);

    while (!(BMI160_SPI_ReadRegBits(BMI160_RA_STATUS, BMI160_STATUS_FOC_RDY, 1))) { HAL_Delay(1); }

    return HAL_OK;
}

int16_t BMI160_SPI_GetXGyroOffset(void) {
	uint8_t readData = 0;
	HAL_StatusTypeDef opStatus = BMI160_ReadSPI(BMI160_RA_OFFSET_3, &readData, 1);

	if(opStatus != HAL_OK){ return opStatus; }

	int16_t offset = readData;

	offset |= (int16_t)(BMI160_SPI_ReadRegBits(BMI160_RA_OFFSET_6, BMI160_GYR_OFFSET_X_MSB_BIT, BMI160_GYR_OFFSET_X_MSB_LEN)) << 8;
    return (int16_t)BMI160_SIGN_EXTEND(offset, 10);
}

HAL_StatusTypeDef BMI160_SPI_SetXGyroOffset(int16_t offset) {
    uint8_t commandToSend[1] = {0x00};
    commandToSend[0] = offset;

    HAL_StatusTypeDef opStatus = BMI160_WriteSPI(BMI160_RA_OFFSET_3, &commandToSend[0], 1);
	if(opStatus != HAL_OK) { return opStatus; }

	opStatus = BMI160_SPI_WriteRegisterBits(BMI160_RA_OFFSET_6, offset >> 8, BMI160_GYR_OFFSET_X_MSB_BIT, BMI160_GYR_OFFSET_X_MSB_LEN);

	if(opStatus != HAL_OK) { return opStatus; }
	return HAL_OK;
}

int16_t BMI160_SPI_GetYGyroOffset(void) {
	uint8_t readData = 0;
	HAL_StatusTypeDef opStatus = BMI160_ReadSPI(BMI160_RA_OFFSET_4, &readData, 1);

	if(opStatus != HAL_OK){ return opStatus; }

	int16_t offset = readData;
    offset |= (int16_t)(BMI160_SPI_ReadRegBits(BMI160_RA_OFFSET_6, BMI160_GYR_OFFSET_Y_MSB_BIT, BMI160_GYR_OFFSET_Y_MSB_LEN)) << 8;
    return BMI160_SIGN_EXTEND(offset, 10);
}

int16_t BMI160_SPI_GetZGyroOffset(void) {
	uint8_t readData = 0;
	HAL_StatusTypeDef opStatus = BMI160_ReadSPI(BMI160_RA_OFFSET_5, &readData, 1);

	if(opStatus != HAL_OK){ return opStatus; }

	int16_t offset = readData;
    offset |= (int16_t)(BMI160_SPI_ReadRegBits(BMI160_RA_OFFSET_6, BMI160_GYR_OFFSET_Z_MSB_BIT, BMI160_GYR_OFFSET_Z_MSB_LEN)) << 8;
    return BMI160_SIGN_EXTEND(offset, 10);
}

HAL_StatusTypeDef BMI160_SPI_SetZGyroOffset(int16_t offset) {
    uint8_t commandToSend[1] = {0x00};
    commandToSend[0] = offset;
    HAL_StatusTypeDef opStatus = BMI160_WriteSPI(BMI160_RA_OFFSET_5, &commandToSend[0], 1);

	if(opStatus != HAL_OK) { return opStatus; }

	opStatus = BMI160_SPI_WriteRegisterBits(BMI160_RA_OFFSET_6, offset >> 8, BMI160_GYR_OFFSET_Z_MSB_BIT, BMI160_GYR_OFFSET_Z_MSB_LEN);

	if(opStatus != HAL_OK) { return opStatus; }
	return HAL_OK;
}

uint8_t BMI160_SPI_GetFreefallDetectionThreshold(void) {
	uint8_t readData = 0;
	HAL_StatusTypeDef opStatus = BMI160_ReadSPI(BMI160_RA_INT_LOWHIGH_1, &readData, 1);

	if(opStatus != HAL_OK) { return opStatus; }
    return readData;
}

HAL_StatusTypeDef BMI160_SPI_SetFreefallDetectionThreshold(uint8_t threshold) {
    uint8_t dataToSend[1] = {0x00};
    dataToSend[0] = threshold;

	HAL_StatusTypeDef opStatus = BMI160_WriteSPI(BMI160_RA_INT_LOWHIGH_1, &dataToSend[0], 1);
    return opStatus;
}

uint8_t BMI160_SPI_GetFreefallDetectionDuration(void) {
	uint8_t readData = 0;
	HAL_StatusTypeDef opStatus = BMI160_ReadSPI(BMI160_RA_INT_LOWHIGH_0, &readData, 1);

	if(opStatus != HAL_OK) { return opStatus; }

    return readData;
}

HAL_StatusTypeDef BMI160_SPI_SetFreefallDetectionDuration(uint8_t duration) {
    uint8_t dataToSend[1] = {0x00};
    dataToSend[0] = duration;
	HAL_StatusTypeDef opStatus = BMI160_WriteSPI(BMI160_RA_INT_LOWHIGH_0, &dataToSend[0], 1);
    return opStatus;
}

uint8_t BMI160_SPI_GetShockDetectionThreshold(void) {
	uint8_t readData = 0;
	HAL_StatusTypeDef opStatus = BMI160_ReadSPI(BMI160_RA_INT_LOWHIGH_4, &readData, 1);

	if(opStatus != HAL_OK) { return opStatus; }

    return readData;
}

HAL_StatusTypeDef BMI160_SPI_SetShockDetectionThreshold(uint8_t threshold) {
    uint8_t dataToSend[1] = {0x00};
    dataToSend[0] = threshold;
	HAL_StatusTypeDef opStatus = BMI160_WriteSPI(BMI160_RA_INT_LOWHIGH_4, &dataToSend[0], 1);
    return opStatus;
}

uint8_t BMI160_SPI_GetShockDetectionDuration(void) {
	uint8_t readData = 0;
	HAL_StatusTypeDef opStatus = BMI160_ReadSPI(BMI160_RA_INT_LOWHIGH_3, &readData, 1);

	if(opStatus != HAL_OK) { return opStatus; }

    return readData;
}

HAL_StatusTypeDef BMI160_SPI_SetShockDetectionDuration(uint8_t duration) {
    uint8_t dataToSend[1] = {0x00};
    dataToSend[0] = duration;
	HAL_StatusTypeDef opStatus = BMI160_WriteSPI(BMI160_RA_INT_LOWHIGH_3, &dataToSend[0], 1);
    return opStatus;
}

uint8_t BMI160_SPI_GetStepDetectionMode(void) {
    uint8_t ret_step_conf0 = 0;
    uint8_t ret_min_step_buf = 0;

	BMI160_ReadSPI(BMI160_RA_STEP_CONF_0, &ret_step_conf0, 1);
	BMI160_ReadSPI(BMI160_RA_STEP_CONF_0, &ret_min_step_buf, 1);

