wojtek327/-49-_stm32_bmi160_spi/stm32_bmi160_spi.c
    if ((ret_step_conf0 == BMI160_RA_STEP_CONF_0_NOR) && (ret_min_step_buf == BMI160_RA_STEP_CONF_1_NOR)) {
    	return BMI160_STEP_MODE_NORMAL;
    }
    else if ((ret_step_conf0 == BMI160_RA_STEP_CONF_0_SEN) && (ret_min_step_buf == BMI160_RA_STEP_CONF_1_SEN)) {
    	return BMI160_STEP_MODE_SENSITIVE;
	}
    else if ((ret_step_conf0 == BMI160_RA_STEP_CONF_0_ROB) && (ret_min_step_buf == BMI160_RA_STEP_CONF_1_ROB)) {
    	return BMI160_STEP_MODE_ROBUST;
    }
    else {
    	return BMI160_STEP_MODE_UNKNOWN;
    }
}

HAL_StatusTypeDef BMI160_SPI_SetStepDetectionMode(BMI160StepMode mode) {
    uint8_t step_conf0 = 0;
    uint8_t min_step_buf = 0;

    switch (mode)
    {
		case BMI160_STEP_MODE_NORMAL:
			step_conf0 = 0x15;
			min_step_buf = 0x3;
			break;
		case BMI160_STEP_MODE_SENSITIVE:
			step_conf0 = 0x2D;
			min_step_buf = 0x0;
			break;
		case BMI160_STEP_MODE_ROBUST:
			step_conf0 = 0x1D;
			min_step_buf = 0x7;
			break;
		default:
			return HAL_ERROR;
    };

    uint8_t dataToSend[1] = {0x00};
    dataToSend[0] = step_conf0;
	BMI160_WriteSPI(BMI160_RA_STEP_CONF_0, &dataToSend[0], 1);
    BMI160_SPI_WriteRegisterBits(BMI160_RA_STEP_CONF_1, min_step_buf, BMI160_STEP_BUF_MIN_BIT, BMI160_STEP_BUF_MIN_LEN);

    return HAL_OK;
}

uint8_t BMI160_SPI_GetStepCountEnabled(void) {
    return !!(BMI160_SPI_ReadRegBits(BMI160_RA_STEP_CONF_1, BMI160_STEP_CNT_EN_BIT, 1));
}

HAL_StatusTypeDef BMI160_SPI_SetStepCountEnabled(uint8_t enabled) {
    return BMI160_SPI_WriteRegisterBits(BMI160_RA_STEP_CONF_1, enabled ? 0x1 : 0, BMI160_STEP_CNT_EN_BIT, 1);
}

uint16_t BMI160_SPI_GetStepCount(void) {
    uint8_t buffer[2];
    buffer[0] = BMI160_RA_STEP_CNT_L;

    BMI160_ReadWriteSPI(BMI160_RA_STEP_CNT_L, &buffer[0], 2);

    return (((uint16_t)buffer[1]) << 8) | buffer[0];
}

HAL_StatusTypeDef BMI160_SPI_ResetStepCount(void) {
    uint8_t dataToSend[1] = {0x00};
    dataToSend[0] = BMI160_CMD_STEP_CNT_CLR;
    HAL_StatusTypeDef opStatus = BMI160_WriteSPI(BMI160_RA_CMD, &dataToSend[0], 1);

    return opStatus;
}

HAL_StatusTypeDef BMI160_SPI_GetMotionDetectionThreshold(void) {
	uint8_t readData = 0;
	HAL_StatusTypeDef opStatus = BMI160_ReadSPI(BMI160_RA_INT_MOTION_1, &readData, 1);

	if(opStatus != HAL_OK) { return opStatus; }
    return readData;
}

HAL_StatusTypeDef BMI160_SPI_SetMotionDetectionThreshold(uint8_t threshold) {
    uint8_t dataToSend[1] = {0x00};
    dataToSend[0] = threshold;
    HAL_StatusTypeDef opStatus = BMI160_WriteSPI(BMI160_RA_INT_MOTION_1, &dataToSend[0], 1);
    return opStatus;
}

uint8_t BMI160_SPI_GetMotionDetectionDuration(void) {
    return (1 + BMI160_SPI_ReadRegBits(BMI160_RA_INT_MOTION_0, BMI160_ANYMOTION_DUR_BIT, BMI160_ANYMOTION_DUR_LEN));
}

HAL_StatusTypeDef BMI160_SPI_SetMotionDetectionDuration(uint8_t samples) {
	return BMI160_SPI_WriteRegisterBits(BMI160_RA_INT_MOTION_0, samples - 1, BMI160_ANYMOTION_DUR_BIT, BMI160_ANYMOTION_DUR_LEN);
}

uint8_t BMI160_SPI_GetZeroMotionDetectionThreshold(void) {
	uint8_t readData = 0;
	HAL_StatusTypeDef opStatus = BMI160_ReadSPI(BMI160_RA_INT_MOTION_2, &readData, 1);

	if(opStatus != HAL_OK) { return opStatus; }

	return readData;
}

HAL_StatusTypeDef BMI160_SPI_SetZeroMotionDetectionThreshold(const uint8_t threshold) {
    uint8_t dataToSend[1] = {0x00};
    dataToSend[0] = threshold;

    HAL_StatusTypeDef opStatus = BMI160_WriteSPI(BMI160_RA_INT_MOTION_2, &dataToSend[0], 1);
    return opStatus;
}

uint8_t BMI160_SPI_GetZeroMotionDetectionDuration(void) {
    return BMI160_SPI_ReadRegBits(BMI160_RA_INT_MOTION_0, BMI160_NOMOTION_DUR_BIT, BMI160_NOMOTION_DUR_LEN);
}

HAL_StatusTypeDef BMI160_SPI_SetZeroMotionDetectionDuration(const uint8_t duration) {
	return BMI160_SPI_WriteRegisterBits(BMI160_RA_INT_MOTION_0, duration, BMI160_NOMOTION_DUR_BIT, BMI160_NOMOTION_DUR_LEN);
}

uint8_t BMI160_SPI_GetTapDetectionThreshold(void) {
    return BMI160_SPI_ReadRegBits(BMI160_RA_INT_TAP_1, BMI160_TAP_THRESH_BIT, BMI160_TAP_THRESH_LEN);
}

HAL_StatusTypeDef BMI160_SPI_SetTapDetectionThreshold(const uint8_t threshold) {
	return BMI160_SPI_WriteRegisterBits(BMI160_RA_INT_TAP_1, threshold, BMI160_TAP_THRESH_BIT, BMI160_TAP_THRESH_LEN);
}

uint8_t BMI160_SPI_GetTapShockDuration(void) {
    return !!(BMI160_SPI_ReadRegBits(BMI160_RA_INT_TAP_0, BMI160_TAP_SHOCK_BIT, 1));
}

static HAL_StatusTypeDef BMI160_SPI_WriteRegister(uint8_t address, uint8_t cmd)
{
	uint8_t buff[1] ={cmd};
	return BMI160_WriteSPI(address, &buff[0], 1);
}

static HAL_StatusTypeDef BMI160_SPI_ReadRegister(uint8_t address, uint8_t dataSize, uint8_t *rec)
{
	uint8_t array[20] = {0xA5};

	HAL_StatusTypeDef opStatus = BMI160_ReadSPI(address, &array[0], dataSize);

	if(opStatus != HAL_OK) {return HAL_ERROR;}

	for(uint8_t i=0; i<dataSize; i++)
	{
		*(rec + i) = array[i];
	}

	return opStatus;
}

static HAL_StatusTypeDef BMI160_WriteSPI(const uint8_t registerAddr, uint8_t *bufferPtr, const uint8_t bufferSize)
{
	uint8_t spiReg = registerAddr;
	_BMI160_CS_ENABLE();

	HAL_StatusTypeDef opStatus = HAL_SPI_Transmit(&hspi1, &spiReg, 1, 10);

	if(opStatus != HAL_OK) {
		_BMI160_CS_DISABLE();
		return opStatus;
	}
    opStatus = HAL_SPI_Transmit(&hspi1, bufferPtr, bufferSize, 10);

    _BMI160_CS_DISABLE();

	if(opStatus != HAL_OK) {
		return opStatus;
	}
	return 0;
}

static HAL_StatusTypeDef BMI160_ReadSPI(const uint8_t registerAddr, uint8_t *bufferPtr, const uint8_t bufferSize)
{
	uint8_t spiBuf[15] = {0x00};
	spiBuf[0] = registerAddr | 0x80;

	_BMI160_CS_ENABLE();

	HAL_StatusTypeDef opStatus = HAL_SPI_Transmit(&hspi1, spiBuf, 1, 20);

	if(opStatus != HAL_OK) {
		_BMI160_CS_DISABLE();
		return opStatus;
	}

	opStatus = HAL_SPI_Receive(&hspi1, spiBuf, bufferSize, 30);

	_BMI160_CS_DISABLE();

	if(opStatus != HAL_OK) {
		return opStatus;
	}

	for(uint8_t i=0; i<(bufferSize); i++){
		*(bufferPtr + i) = spiBuf[i];
	}

	return 0;
}

static uint8_t BMI160_SPI_ReadRegBits(uint8_t reg, unsigned pos, unsigned len)
{
	uint8_t readData = 0;
	HAL_StatusTypeDef opStatus = BMI160_ReadSPI(reg, &readData, 1);

	if(opStatus != HAL_OK) { return 0x00; }

    uint8_t mask = (1 << len) - 1;
    readData >>= pos;
    readData &= mask;

    return readData;
}

static HAL_StatusTypeDef BMI160_SPI_WriteRegisterBits(uint8_t reg, uint8_t data, unsigned pos, unsigned len)
{
	uint8_t readData = 0;
	HAL_StatusTypeDef opStatus = BMI160_ReadSPI(reg, &readData, 1);

	if(opStatus != HAL_OK) { return opStatus; }

    uint8_t mask = ((1 << len) - 1) << pos;

    data <<= pos;
    data &= mask;
    readData &= ~(mask);
    readData |= data;

    return BMI160_WriteSPI(reg, &readData, 1);
}

static HAL_StatusTypeDef BMI160_ReadWriteSPI(const uint8_t registerAddr, uint8_t *bufferPtr, const uint8_t bufferSize)
{
	uint8_t spiBuf[15] = {0x00};
	uint8_t recBuffer[15] = {0x00};
	spiBuf[0] = registerAddr | 0x80;

	_BMI160_CS_ENABLE();

	HAL_StatusTypeDef opstatus = HAL_SPI_TransmitReceive(&hspi1, spiBuf, recBuffer, bufferSize, 50);

	_BMI160_CS_DISABLE();

	for(uint8_t i=0; i<(bufferSize); i++){
		*(bufferPtr + i) = recBuffer[i+1];
	}

	return opstatus;
}

